---
kind: property
id: P:Autodesk.Revit.DB.BasicFileInfo.Username
source: html/896036da-c37a-ce47-82dc-9d26ab722897.htm
---
# Autodesk.Revit.DB.BasicFileInfo.Username Property

Returns the username.

## Syntax (C#)
```csharp
public string Username { get; }
```